tap "borkdude/brew"
tap "buo/cask-upgrade"
tap "clojure-lsp/brew"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "eugmes/fntsample"
tap "felixkratz/formulae"
tap "finestructure/hummingbird"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "medoc92/recoll", "https://framagit.org/medoc92/recoll"
tap "nailuogg/recoll"
tap "saulpw/vd"
tap "spicetify/tap"
brew "xz"
brew "jpeg-xl"
brew "atuin"
brew "autoconf"
brew "automake"
brew "bash"
brew "openssl@3"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "readline"
brew "black"
brew "boost"
brew "bore-cli"
brew "bottom"
brew "broot"
brew "ccls"
brew "cheat"
brew "chezscheme"
brew "choose-rust"
brew "clang-format"
brew "openjdk"
brew "clojure"
brew "cmake"
brew "conan"
brew "cookiecutter"
brew "curlie"
brew "dbacl"
brew "dust"
brew "duti"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "erlang"
brew "elixir"
brew "emscripten"
brew "exercism"
brew "exiftool"
brew "eza"
brew "fcp"
brew "fd"
brew "gcc"
brew "openblas"
brew "numpy"
brew "tesseract"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "ffsend"
brew "fish"
brew "fisher"
brew "flake8"
brew "flock"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnu-typist"
brew "gnupg@2.2", link: true
brew "hunspell"
brew "lua"
brew "gnuplot"
brew "go"
brew "gping"
brew "librsvg"
brew "graphviz"
brew "pkg-config"
brew "guile"
brew "gum"
brew "hledger"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "libheif"
brew "imagemagick"
brew "ispell"
brew "isync"
brew "jq"
brew "jrnl"
brew "just"
brew "lazygit"
brew "ledger"
brew "leiningen"
brew "libgccjit"
brew "libmagic"
brew "libvterm"
brew "qemu"
brew "lima"
brew "llvm@12"
brew "lsd"
brew "luarocks"
brew "lux"
brew "make"
brew "media-info"
brew "monolith"
brew "msmtp"
brew "mu"
brew "mupdf"
brew "zlib"
brew "mysql", restart_service: true
brew "neovim"
brew "ninja"
brew "notmuch"
brew "nushell"
brew "openjdk@17"
brew "openssl@1.1"
brew "p7zip"
brew "pandoc"
brew "pandoc-crossref"
brew "poppler"
brew "pdf2svg"
brew "pnpm"
brew "poetry"
brew "postgresql@14", restart_service: true
brew "postgresql@15"
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qt@5"
brew "pyqt@5"
brew "pyright"
brew "qsv"
brew "quantlib"
brew "rclone"
brew "reattach-to-user-namespace"
brew "recoll"
brew "rename"
brew "ripgrep"
brew "ripgrep-all", args: ["HEAD"]
brew "rnr"
brew "ruff"
brew "rustup-init"
brew "sbcl"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "spidermonkey"
brew "spoof-mac"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "tealdeer"
brew "tectonic"
brew "thefuck"
brew "tmux"
brew "topgrade"
brew "tor"
brew "transmission-cli"
brew "typst"
brew "ugrep"
brew "unar"
brew "volta"
brew "wget"
brew "wordnet"
brew "xh"
brew "xidel"
brew "yt-dlp"
brew "zbar"
brew "zellij"
brew "zig"
brew "zoxide"
brew "borkdude/brew/babashka"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-dbus", "with-mailutils", "with-native-comp", "with-no-frame-refocus", "with-poll", "with-retro-gnu-meditate-levitate-icon", "with-xwidgets"], link: false
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-dbus", "with-mailutils", "with-native-comp", "with-no-frame-refocus", "with-poll", "with-retro-gnu-meditate-levitate-icon", "with-xwidgets"]
brew "eugmes/fntsample/fntsample"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "saulpw/vd/visidata"
brew "spicetify/tap/spicetify-cli", link: false
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "amethyst"
cask "anki"
cask "bruno"
cask "calibre"
cask "chatgpt"
cask "chromedriver"
cask "disk-inventory-x"
cask "dozer"
cask "dropbox"
cask "eloston-chromium"
cask "espanso"
cask "font-dejavu"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
cask "font-gnu-unifont"
cask "font-go"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-input"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-comfy"
cask "font-iosevka-etoile"
cask "font-iosevka-nerd-font"
cask "font-iosevka-slab"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-open-sans"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "freeplane"
cask "freetube"
cask "hammerspoon"
cask "hummingbird"
cask "iina"
cask "julia"
cask "lepton"
cask "libreoffice"
cask "librewolf"
cask "linearmouse"
cask "macfuse"
cask "mactex"
cask "mark-text"
cask "masscode"
cask "miniconda"
cask "mtmr"
cask "neovide"
cask "notunes"
cask "obs"
cask "pgadmin4"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qt-creator"
cask "quarto"
cask "qutebrowser"
cask "r"
cask "racket"
cask "rar"
cask "rectangle"
cask "rstudio"
cask "selfcontrol"
cask "sf-symbols"
cask "tor-browser"
cask "transmission"
cask "visual-studio-code"
cask "wine-stable"
cask "wineskin"
cask "zotero"
vscode "1yib.svelte-bundle"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "andrsdc.base16-themes"
vscode "ardenivanov.svelte-intellisense"
vscode "asvetliakov.vscode-neovim"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "databricks.databricks"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "emeraldwalk.runonsave"
vscode "fivethree.vscode-svelte-snippets"
vscode "gera2ld.markmap-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "inu1255.easy-snippet"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "juliacomputing.juliahub"
vscode "julialang.language-julia"
vscode "kelvin.vscode-sshfs"
vscode "kevinrose.vsc-python-indent"
vscode "lfs.vscode-emacs-friendly"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "niszet.pandoc-lua-snippet"
vscode "pivaszbs.svelte-autoimport"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "quarto.quarto"
vscode "randomfractalsinc.vscode-data-table"
vscode "redhat.java"
vscode "reditorsupport.r"
vscode "rsolano.pandoc-markdown"
vscode "rust-lang.rust-analyzer"
vscode "ryuta46.multi-command"
vscode "sianglim.slim"
vscode "skellock.just"
vscode "souche.vscode-mindmap"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tobiasalthoff.atom-material-theme"
vscode "twxs.cmake"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziglang.vscode-zig"
