tap "d12frosted/emacs-plus"
tap "finestructure/hummingbird"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
brew "atuin"
brew "bat"
brew "bottom"
brew "cheat"
brew "choose-rust"
brew "cookiecutter"
brew "curlie"
brew "dust"
brew "elixir"
brew "fd"
brew "tesseract"
brew "ffmpeg"
brew "ffsend"
brew "fish"
brew "fzf"
brew "ghostscript"
brew "git"
brew "go"
brew "gping"
brew "imagemagick"
brew "jq"
brew "jrnl"
brew "just"
brew "lazygit"
brew "lima"
brew "lsd"
brew "lua"
brew "luarocks"
brew "monolith"
brew "mysql"
brew "neovim"
brew "node"
brew "numpy"
brew "pandoc"
brew "pandoc-crossref"
brew "pnpm"
brew "poetry"
brew "postgresql@14", restart_service: true
brew "postgresql@15"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qsv"
brew "quantlib"
brew "ripgrep"
brew "rustup-init"
brew "sd"
brew "spidermonkey"
brew "spoof-mac"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "topgrade"
brew "watchman"
brew "wget"
brew "xh"
brew "zbar"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-imagemagick", "with-native-comp", "with-xwidgets"]
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alfred"
cask "amethyst"
cask "chatgpt"
cask "chromedriver"
cask "dozer"
cask "espanso"
cask "font-hack"
cask "font-hack-nerd-font"
cask "hummingbird"
cask "iterm2"
cask "julia"
cask "mactex"
cask "miniconda"
cask "neovide"
cask "pgadmin4"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "rectangle"
cask "sioyek"
cask "visual-studio-code"
cask "wezterm"
cask "zotero"
