tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "finestructure/hummingbird"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
brew "atuin"
brew "bash"
brew "bat"
brew "bottom"
brew "broot"
brew "cheat"
brew "choose-rust"
brew "cookiecutter"
brew "curlie"
brew "dust"
brew "duti"
brew "folly"
brew "edencommon"
brew "elixir"
brew "exercism"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fcp"
brew "fd"
brew "tesseract"
brew "ffmpeg"
brew "ffsend"
brew "fish"
brew "fisher"
brew "fzf"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "go"
brew "gping"
brew "httpie"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "jrnl"
brew "just"
brew "lazygit"
brew "qemu"
brew "lima"
brew "lsd"
brew "lua"
brew "luarocks"
brew "monolith"
brew "mysql"
brew "neovim"
brew "node"
brew "openblas"
brew "numpy"
brew "pandoc"
brew "pandoc-crossref"
brew "pnpm"
brew "poetry"
brew "postgresql@14", restart_service: true
brew "postgresql@15"
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyqt@5"
brew "qsv"
brew "quantlib"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ripgrep-all"
brew "rustup-init"
brew "sd"
brew "spidermonkey"
brew "spoof-mac"
brew "starship"
brew "tealdeer"
brew "thefuck"
brew "tmux"
brew "topgrade"
brew "typst"
brew "watchman"
brew "wget"
brew "xh"
brew "zbar"
brew "zellij"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-imagemagick", "with-native-comp", "with-xwidgets"]
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "calibre"
cask "chatgpt"
cask "chromedriver"
cask "dozer"
cask "espanso"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-meslo-lg-nerd-font"
cask "font-open-sans"
cask "hummingbird"
cask "iterm2"
cask "julia"
cask "macfuse"
cask "mactex"
cask "mark-text"
cask "miniconda"
cask "neovide"
cask "obs"
cask "pgadmin4"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quarto"
cask "qutebrowser"
cask "rectangle"
cask "sioyek"
cask "unofficial-wineskin"
cask "visual-studio-code"
cask "wezterm"
cask "zettlr"
cask "zotero"
